In [1]:
import pandas as pd

### 2 main data types in pandas

In [2]:
series = pd.Series(["BMW","Toyota","Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

**series is 1D**

In [4]:
colors = pd.Series(["Red","Yellow","Green"])

In [5]:
colors

0       Red
1    Yellow
2     Green
dtype: object

* Data frames most common data types than series
* Data frames is **2D**

In [6]:
car_data = pd.DataFrame({"Car Makers": series, "Color": colors})
car_data

  Car Makers   Color
0        BMW     Red
1     Toyota  Yellow
2      Honda   Green

Most of times we don't create **data frames**, insteated we import them

In [7]:
#import data
car_sales = pd.read_csv('car-sales.csv')

In [9]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

Now this data in pandas data frames now we can take advantages of all data frames operations

### Exporting into csv

In [11]:
car_sales.to_csv('exported_car_sales.csv')

In [12]:
exported_car_sales = pd.read_csv('exported_car_sales.csv')
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

When you are exporting csv and if you don't put `index=False` then it also export index

In [13]:
car_sales.to_csv('exported_car_sales.csv', index=False)

In [ ]:
exported_car_sales.to